In [0]:
import pandas as pd

In [0]:
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter11/dataset/breast-cancer-wisconsin.data'

In [0]:
df = pd.read_csv(file_url, header=None)

In [4]:
df.head()

        0   1   2   3   4   5   6   7   8   9   10
0  1000025   5   1   1   1   2   1   3   1   1   2
1  1002945   5   4   4   5   7  10   3   2   1   2
2  1015425   3   1   1   1   2   2   3   1   1   2
3  1016277   6   8   8   1   3   4   3   7   1   2
4  1017023   4   1   1   3   2   1   3   1   1   2

Data having no Colomns Values Indicates from Dataset file will have to assign column names to Dataset

Create a variable called col_names that contains the names of the columns: Sample code number, Clump Thickness, Uniformity of Cell Size, Uniformity of Cell Shape, Marginal Adhesion, Single Epithelial Cell Size, Bare Nuclei, Bland Chromatin, Normal Nucleoli, Mitoses, and Class:

In [0]:
col_names = ['Sample code number','Clump Thickness','Uniformity of Cell Size','Uniformity of Cell Shape','Marginal Adhesion','Single Epithelial Cell Size',
'Bare Nuclei','Bland Chromatin','Normal Nucleoli','Mitoses','Class']

In [0]:
df.columns = col_names

In [7]:
df.shape

(699, 11)

In [8]:
df.head()

   Sample code number  Clump Thickness  ...  Mitoses  Class
0             1000025                5  ...        1      2
1             1002945                5  ...        1      2
2             1015425                3  ...        1      2
3             1016277                6  ...        1      2
4             1017023                4  ...        1      2

[5 rows x 11 columns]

In [9]:
df.duplicated().sum()

8

In [10]:
df.loc[df.duplicated()]

     Sample code number  Clump Thickness  ...  Mitoses  Class
208             1218860                1  ...        1      2
253             1100524                6  ...        3      4
254             1116116                9  ...        1      4
258             1198641                3  ...        1      2
272              320675                3  ...        1      4
338              704097                1  ...        1      2
561             1321942                5  ...        1      2
684              466906                1  ...        1      2

[8 rows x 11 columns]

In [11]:
df.loc[df.duplicated(keep='last')]

     Sample code number  Clump Thickness  ...  Mitoses  Class
42              1100524                6  ...        3      4
62              1116116                9  ...        1      4
168             1198641                3  ...        1      2
207             1218860                1  ...        1      2
267              320675                3  ...        1      4
314              704097                1  ...        1      2
560             1321942                5  ...        1      2
683              466906                1  ...        1      2

[8 rows x 11 columns]

In [0]:
df_unique = df.drop_duplicates(keep='first')

In [13]:
df_unique.shape

(691, 11)

**Converting Data Types**

In [0]:
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter10/dataset/ames_iowa_housing.csv'

In [0]:
df1 = pd.read_csv(file_url)

In [16]:
df1.head()

   Id  MSSubClass MSZoning  ...  SaleType  SaleCondition SalePrice
0   1          60       RL  ...        WD         Normal    208500
1   2          20       RL  ...        WD         Normal    181500
2   3          60       RL  ...        WD         Normal    223500
3   4          70       RL  ...        WD        Abnorml    140000
4   5          60       RL  ...        WD         Normal    250000

[5 rows x 81 columns]

In [17]:
df1.dtypes

Id                 int64
MSSubClass         int64
MSZoning          object
LotFrontage      float64
LotArea            int64
                  ...
MoSold             int64
YrSold             int64
SaleType          object
SaleCondition     object
SalePrice          int64
Length: 81, dtype: object

Analyzing a Dataset you know that the Id, MSSubClass, OverallQual, and OverallCond columns have been incorrectly classified as numerical variables. They have a finite number of unique values and you can't perform any mathematical operations on them. For example, it doesn't make sense to add, remove, multiply, or divide two different values from the Id column. Therefore, you need to convert them into categorical variables.

Using the astype() method, convert the 'Id' column into a categorical variable, as shown in the following code snippet:

In [0]:
df1['Id'] = df1['Id'].astype('category')

In [0]:
df1['MSSubClass'] = df1['MSSubClass'].astype('category')
df1['OverallQual'] = df1['OverallQual'].astype('category')
df1['OverallCond'] = df1['OverallCond'].astype('category')

Create a for loop that will iterate through the four categorical columns ('Id', 'MSSubClass', 'OverallQual', and 'OverallCond') and print their names and categories using the .cat.categories attribute:

In [20]:
for col_name in ['Id', 'MSSubClass', 'OverallQual', 'OverallCond']:
  print(col_name)
  print(df1[col_name].cat.categories)

Id
Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1451, 1452, 1453, 1454, 1455, 1456, 1457, 1458, 1459, 1460],
           dtype='int64', length=1460)
MSSubClass
Int64Index([20, 30, 40, 45, 50, 60, 70, 75, 80, 85, 90, 120, 160, 180, 190], dtype='int64')
OverallQual
Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], dtype='int64')
OverallCond
Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

Create a new DataFrame called obj_df that will only contain variables of the object type using the select_dtypes method along with the include='object' parameter:

In [0]:
obj_df1 = df1.select_dtypes(include='object')

Create a new variable called obj_cols that contains a list of column names from the obj_df DataFrame using the .columns attribute and display its content:

In [22]:
obj_cols = obj_df1.columns
obj_cols

Index(['MSZoning', 'Street', 'Alley', 'LotShape', 'LandContour', 'Utilities',
       'LotConfig', 'LandSlope', 'Neighborhood', 'Condition1', 'Condition2',
       'BldgType', 'HouseStyle', 'RoofStyle', 'RoofMatl', 'Exterior1st',
       'Exterior2nd', 'MasVnrType', 'ExterQual', 'ExterCond', 'Foundation',
       'BsmtQual', 'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinType2',
       'Heating', 'HeatingQC', 'CentralAir', 'Electrical', 'KitchenQual',
       'Functional', 'FireplaceQu', 'GarageType', 'GarageFinish', 'GarageQual',
       'GarageCond', 'PavedDrive', 'PoolQC', 'Fence', 'MiscFeature',
       'SaleType', 'SaleCondition'],
      dtype='object')

Like we did in Step 8, create a for loop that will iterate through the column names contained in obj_cols and print their names and unique values using the unique() method:

In [23]:
for col_name in obj_cols:
  print(col_name)
  print(df1[col_name].unique())

MSZoning
['RL' 'RM' 'C (all)' 'FV' 'RH']
Street
['Pave' 'Grvl']
Alley
[nan 'Grvl' 'Pave']
LotShape
['Reg' 'IR1' 'IR2' 'IR3']
LandContour
['Lvl' 'Bnk' 'Low' 'HLS']
Utilities
['AllPub' 'NoSeWa']
LotConfig
['Inside' 'FR2' 'Corner' 'CulDSac' 'FR3']
LandSlope
['Gtl' 'Mod' 'Sev']
Neighborhood
['CollgCr' 'Veenker' 'Crawfor' 'NoRidge' 'Mitchel' 'Somerst' 'NWAmes'
 'OldTown' 'BrkSide' 'Sawyer' 'NridgHt' 'NAmes' 'SawyerW' 'IDOTRR'
 'MeadowV' 'Edwards' 'Timber' 'Gilbert' 'StoneBr' 'ClearCr' 'NPkVill'
 'Blmngtn' 'BrDale' 'SWISU' 'Blueste']
Condition1
['Norm' 'Feedr' 'PosN' 'Artery' 'RRAe' 'RRNn' 'RRAn' 'PosA' 'RRNe']
Condition2
['Norm' 'Artery' 'RRNn' 'Feedr' 'PosN' 'PosA' 'RRAn' 'RRAe']
BldgType
['1Fam' '2fmCon' 'Duplex' 'TwnhsE' 'Twnhs']
HouseStyle
['2Story' '1Story' '1.5Fin' '1.5Unf' 'SFoyer' 'SLvl' '2.5Unf' '2.5Fin']
RoofStyle
['Gable' 'Hip' 'Gambrel' 'Mansard' 'Flat' 'Shed']
RoofMatl
['CompShg' 'WdShngl' 'Metal' 'WdShake' 'Membran' 'Tar&Grv' 'Roll'
 'ClyTile']
Exterior1st
['VinylSd' 'MetalSd' 'Wd Sdng' 'HdBoard' 'BrkFace' 'WdShing' 'CemntBd'
 'Plywood' 'AsbShng' 'Stucco' 'BrkComm' 'AsphShn' 'Stone' 'ImStucc'
 'CBlock']
Exterior2nd
['VinylSd' 'MetalSd' 'Wd Shng' 'HdBoard' 'Plywood' 'Wd Sdng' 'CmentBd'
 'BrkFace' 'Stucco' 'AsbShng' 'Brk Cmn' 'ImStucc' 'AsphShn' 'Stone'
 'Other' 'CBlock']
MasVnrType
['BrkFace' 'None' 'Stone' 'BrkCmn' nan]
ExterQual
['Gd' 'TA' 'Ex' 'Fa']
ExterCond
['TA' 'Gd' 'Fa' 'Po' 'Ex']
Foundation
['PConc' 'CBlock' 'BrkTil' 'Wood' 'Slab' 'Stone']
BsmtQual
['Gd' 'TA' 'Ex' nan 'Fa']
BsmtCond
['TA' 'Gd' nan 'Fa' 'Po']
BsmtExposure
['No' 'Gd' 'Mn' 'Av' nan]
BsmtFinType1
['GLQ' 'ALQ' 'Unf' 'Rec' 'BLQ' nan 'LwQ']
BsmtFinType2
['Unf' 'BLQ' nan 'ALQ' 'Rec' 'LwQ' 'GLQ']
Heating
['GasA' 'GasW' 'Grav' 'Wall' 'OthW' 'Floor']
HeatingQC
['Ex' 'Gd' 'TA' 'Fa' 'Po']
CentralAir
['Y' 'N']
Electrical
['SBrkr' 'FuseF' 'FuseA' 'FuseP' 'Mix' nan]
KitchenQual
['Gd' 'TA' 'Ex' 'Fa']
Functional
['Typ' 'Min1' 'Maj1' 'Min2' 'Mod' 'Maj2' 'Sev']
FireplaceQu
[nan 'TA' 'Gd' 'Fa' 'Ex' 'Po']
GarageType
['Attchd' 'Detchd' 'BuiltIn' 'CarPort' nan 'Basment' '2Types']
GarageFinish
['RFn' 'Unf' 'Fin' nan]
GarageQual
['TA' 'Fa' 'Gd' nan 'Ex' 'Po']
GarageCond
['TA' 'Fa' nan 'Gd' 'Po' 'Ex']
PavedDrive
['Y' 'N' 'P']
PoolQC
[nan 'Ex' 'Fa' 'Gd']
Fence
[nan 'MnPrv' 'GdWo' 'GdPrv' 'MnWw']
MiscFeature
[nan 'Shed' 'Gar2' 'Othr' 'TenC']
SaleType
['WD' 'New' 'COD' 'ConLD' 'ConLI' 'CWD' 'ConLw' 'Con' 'Oth']
SaleCondition
['Normal' 'Abnorml' 'Partial' 'AdjLand' 'Alloca' 'Family']

Now, create a for loop that will iterate through the column names contained in obj_cols and convert each of them into a categorical variable using the astype() method:

In [0]:
for col_name in obj_cols:
  df1[col_name] = df1[col_name].astype('category')

In [25]:
df1.dtypes

Id               category
MSSubClass       category
MSZoning         category
LotFrontage       float64
LotArea             int64
                   ...
MoSold              int64
YrSold              int64
SaleType         category
SaleCondition    category
SalePrice           int64
Length: 81, dtype: object

Perfect! You have successfully converted the columns that have incorrect data types (numerical or object) into categorical variables. Your dataset is now one step closer to being prepared for modeling.

**Handling Incorrect Values**

In [0]:
import pandas as pd
file_url = 'https://github.com/PacktWorkshops/The-Data-Science-Workshop/blob/master/Chapter10/dataset/Online%20Retail.xlsx?raw=true'
df2 = pd.read_excel(file_url)

In [27]:
df2.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

as StockCode 23131, the Description column has different values:

In [28]:
df2.loc[df2['StockCode'] == 23131, 'Description'].unique()

array(['MISTLETOE HEART WREATH CREAM', 'MISELTOE HEART WREATH WHITE',
       'MISELTOE HEART WREATH CREAM', '?', 'had been put aside', nan],
      dtype=object)

There are multiple issues in the preceding output. One issue is that the word Mistletoe has been misspelled so that it reads Miseltoe. The other errors are unexpected values and missing values, which will be covered in the next section. It seems that the Description column has been used to record comments such as had been put aside.

Let's focus on the misspelling issue. What we need to do here is modify the incorrect spelling and replace it with the correct value. First, let's create a new column called StockCodeDescription, which is an exact copy of the Description column:

In [0]:
df2['StockCodeDescription'] = df2['Description']

You will use this new column to fix the misspelling issue. To do this, use the subsetting technique you learned about earlier in this chapter. You need to use .loc and filter the rows and columns you want, that is, all rows with StockCode == 21131 and Description == MISELTOE HEART WREATH CREAM and the Description column:

In [0]:
df.loc[(df2['StockCode'] == 23131) & (df2['StockCodeDescription'] == 'MISELTOE HEART WREATH CREAM'), 'StockCodeDescription'] = 'MISTLETOE HEART WREATH CREAM'

If you reprint the value for this issue, you will see that the misspelling value has been fixed and is not present anymore:

In [31]:
df2.loc[df2['StockCode'] == 23131, 'StockCodeDescription'].unique()

array(['MISTLETOE HEART WREATH CREAM', 'MISELTOE HEART WREATH WHITE',
       'MISELTOE HEART WREATH CREAM', '?', 'had been put aside', nan],
      dtype=object)

As you can see, there are still five different values for this product, but for one of them, that is, MISTLETOE, has been spelled incorrectly: MISELTOE.

This time, rather than looking at an exact match (a word must be the same as another one), we will look at performing a partial match (part of a word will be present in another word). In our case, instead of looking at the spelling of MISELTOE, we will only look at MISEL. The pandas package provides a method called .str.contains() that we can use to look for observations that partially match with a given expression.

Let's use this to see if we have the same misspelling issue (MISEL) in the entire dataset. You will need to add one additional parameter since this method doesn't handle missing values. You will also have to subset the rows that don't have missing values for the Description column. This can be done by providing the na=False parameter to the .str.contains() method:

In [32]:
df2.loc[df2['StockCodeDescription'].str.contains('MISEL', na=False),]

       InvoiceNo StockCode  ...          Country         StockCodeDescription
186760    552882     23131  ...      Netherlands  MISELTOE HEART WREATH WHITE
186761    552882     23130  ...      Netherlands       MISELTOE HEART WREATH
195286    553711     23130  ...   United Kingdom       MISELTOE HEART WREATH
195288    553711     23131  ...   United Kingdom  MISELTOE HEART WREATH WHITE
285379    561901     23131  ...             EIRE  MISELTOE HEART WREATH CREAM
372887    569252     23130  ...   United Kingdom       MISELTOE HEART WREATH
373325    569324     23131  ...   United Kingdom  MISELTOE HEART WREATH WHITE
373327    569324     23130  ...   United Kingdom       MISELTOE HEART WREATH
377632    569558     23131  ...  Channel Islands  MISELTOE HEART WREATH WHITE
377635    569558     23130  ...  Channel Islands       MISELTOE HEART WREATH

[10 rows x 9 columns]

This misspelling issue (MISELTOE) is not only related to StockCode 23131, but also to other items. You will need to fix all of these using the str.replace() method. This method takes the string of characters to be replaced and the replacement string as parameters:

In [0]:
df2['StockCodeDescription'] = df2['StockCodeDescription'].str.replace('MISELTOE', 'MISTLETOE')

Now, if you print all the rows that contain the misspelling of MISEL, you will see that no such rows exist anymore:

In [34]:
df2.loc[df2['StockCodeDescription'].str.contains('MISEL', na=False),]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, StockCodeDescription]
Index: []

 **Fixing Incorrect Values**

In [0]:
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter11/dataset/officers.csv'

In [0]:
df4 = pd.read_csv(file_url)

In [37]:
df4.head()

      ID           City State    Zip      Title  RedactionRequested
0    804       Glenview    IL  60025  Treasurer               False
1   9177     Harrisburg    IL  62946  Treasurer               False
2  53011        Chicago    IL  60606  Treasurer               False
3   9176     Harrisburg    IL  62946   Chairman               False
4  33020  Mechanicsburg    IL  62545   Chairman               False

In [38]:
df4['State'].unique()

array(['IL', 'PA', 'DC', 'Il', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA',
       'IN', 'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'il', 'WA', '8I',
       'In', 'iL', 'OH', 'SC', 'VA', 'NM', 'FL', 'LA', 'GA', 'II', 'NJ',
       'MD', 'I', 'AR', 'KS', 'DE', '60', 'SD', 'MN', 'VT', 'OK', 'KY',
       'CT', 'NH', 'AZ', 'OR', 'PR', 'RI'], dtype=object)

All the states have been encoded into a two-capitalized character format. As you can see, there are some incorrect values with non-capitalized characters, such as il and iL (they look like spelling errors for Illinois), and unexpected values such as 8I, I, and 60. In the next few steps, you are going to fix these issues.

**Handling Incorrect Values**

Another issue you may face with a new dataset is incorrect values for some of the observations in the dataset. Sometimes, this is due to a syntax error

In [0]:
import pandas as pd
file_url = 'https://github.com/PacktWorkshops/The-Data-Science-Workshop/blob/master/Chapter10/dataset/Online%20Retail.xlsx?raw=true'
df = pd.read_excel(file_url)

In [40]:
df.loc[df['StockCode'] == 23131, 'Description'].unique()

array(['MISTLETOE HEART WREATH CREAM', 'MISELTOE HEART WREATH WHITE',
       'MISELTOE HEART WREATH CREAM', '?', 'had been put aside', nan],
      dtype=object)

There are multiple issues in the preceding output. One issue is that the word Mistletoe has been misspelled so that it reads Miseltoe. The other errors are unexpected values and missing values, which will be covered in the next section. It seems that the Description column has been used to record comments such as had been put aside.

Let's focus on the misspelling issue. What we need to do here is modify the incorrect spelling and replace it with the correct value. First, let's create a new column called StockCodeDescription, which is an exact copy of the Description column:

You will use this new column to fix the misspelling issue. To do this, use the subsetting technique you learned about earlier in this chapter. You need to use .loc and filter the rows and columns you want, that is, all rows with StockCode == 21131 and Description == MISELTOE HEART WREATH CREAM and the Description column:

In [0]:
df['StockCodeDescription'] = df['Description']

You will use this new column to fix the misspelling issue. To do this, use the subsetting technique you learned about earlier in this chapter. You need to use .loc and filter the rows and columns you want, that is, all rows with StockCode == 21131 and Description == MISELTOE HEART WREATH CREAM and the Description column:

In [0]:
df.loc[(df['StockCode'] == 23131) & (df['StockCodeDescription'] == 'MISELTOE HEART WREATH CREAM'), 'StockCodeDescription'] = 'MISTLETOE HEART WREATH CREAM'

If you reprint the value for this issue, you will see that the misspelling value has been fixed and is not present anymore:

In [43]:
df.loc[df['StockCode'] == 23131, 'StockCodeDescription'].unique()

array(['MISTLETOE HEART WREATH CREAM', 'MISELTOE HEART WREATH WHITE', '?',
       'had been put aside', nan], dtype=object)

You will need to add one additional parameter since this method doesn't handle missing values. You will also have to subset the rows that don't have missing values for the Description column. This can be done by providing the na=False parameter to the .str.contains() method:

In [44]:
df.loc[df['StockCodeDescription'].str.contains('MISEL', na=False),]

       InvoiceNo StockCode  ...          Country         StockCodeDescription
186760    552882     23131  ...      Netherlands  MISELTOE HEART WREATH WHITE
186761    552882     23130  ...      Netherlands       MISELTOE HEART WREATH
195286    553711     23130  ...   United Kingdom       MISELTOE HEART WREATH
195288    553711     23131  ...   United Kingdom  MISELTOE HEART WREATH WHITE
372887    569252     23130  ...   United Kingdom       MISELTOE HEART WREATH
373325    569324     23131  ...   United Kingdom  MISELTOE HEART WREATH WHITE
373327    569324     23130  ...   United Kingdom       MISELTOE HEART WREATH
377632    569558     23131  ...  Channel Islands  MISELTOE HEART WREATH WHITE
377635    569558     23130  ...  Channel Islands       MISELTOE HEART WREATH

[9 rows x 9 columns]

This misspelling issue (MISELTOE) is not only related to StockCode 23131, but also to other items. You will need to fix all of these using the str.replace() method. This method takes the string of characters to be replaced and the replacement string as parameters:

In [0]:
df['StockCodeDescription'] = df['StockCodeDescription'].str.replace('MISELTOE', 'MISTLETOE')

In [46]:
df.loc[df['StockCodeDescription'].str.contains('MISEL', na=False),]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, StockCodeDescription]
Index: []

You just saw how easy it is to clean observations that have incorrect values using the .str.contains and .str.replace() methods that are provided by the pandas package. These methods can only be used for variables containing strings, but the same logic can be applied to numerical variables and can also be used to handle extreme values or outliers. You can use the ==, >, <, >=, or <= operator to subset the rows you want and then replace the observations with the correct values.

**Handling Missing Values**

In [0]:
import pandas as pd
file_url = 'https://github.com/PacktWorkshops/The-Data-Science-Workshop/blob/master/Chapter10/dataset/Online%20Retail.xlsx?raw=true'
df5 = pd.read_excel(file_url)

In [48]:
df5.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [49]:
df5.isna()

        InvoiceNo  StockCode  Description  ...  UnitPrice  CustomerID  Country
0           False      False        False  ...      False       False    False
1           False      False        False  ...      False       False    False
2           False      False        False  ...      False       False    False
3           False      False        False  ...      False       False    False
4           False      False        False  ...      False       False    False
...           ...        ...          ...  ...        ...         ...      ...
541904      False      False        False  ...      False       False    False
541905      False      False        False  ...      False       False    False
541906      False      False        False  ...      False       False    False
541907      False      False        False  ...      False       False    False
541908      False      False        False  ...      False       False    False

[541909 rows x 8 columns]

In [50]:
df5.isna().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [51]:
df[df['Description'].isna()]

       InvoiceNo StockCode  ...         Country  StockCodeDescription
622       536414     22139  ...  United Kingdom                   NaN
1970      536545     21134  ...  United Kingdom                   NaN
1971      536546     22145  ...  United Kingdom                   NaN
1972      536547     37509  ...  United Kingdom                   NaN
1987      536549    85226A  ...  United Kingdom                   NaN
...          ...       ...  ...             ...                   ...
535322    581199     84581  ...  United Kingdom                   NaN
535326    581203     23406  ...  United Kingdom                   NaN
535332    581209     21620  ...  United Kingdom                   NaN
536981    581234     72817  ...  United Kingdom                   NaN
538554    581408     85175  ...  United Kingdom                   NaN

[1454 rows x 9 columns]

From the preceding output, you can see that all the rows with missing values have 0.0 as the unit price and are missing the CustomerID column. In a real project, you will have to discuss these cases with the business and check whether these transactions are genuine or not. If the business confirms that these observations are irrelevant, then you will need to remove them from the dataset.

The pandas package provides a method that we can use to easily remove missing values: .dropna(). This method returns a new DataFrame without all the rows that have missing values. By default, it will look at all the columns. You can specify a list of columns for it to look for with the subset parameter:

In [52]:
df.dropna(subset=['Description'])

       InvoiceNo StockCode  ...         Country                 StockCodeDescription
0         536365    85123A  ...  United Kingdom   WHITE HANGING HEART T-LIGHT HOLDER
1         536365     71053  ...  United Kingdom                  WHITE METAL LANTERN
2         536365    84406B  ...  United Kingdom       CREAM CUPID HEARTS COAT HANGER
3         536365    84029G  ...  United Kingdom  KNITTED UNION FLAG HOT WATER BOTTLE
4         536365    84029E  ...  United Kingdom       RED WOOLLY HOTTIE WHITE HEART.
...          ...       ...  ...             ...                                  ...
541904    581587     22613  ...          France          PACK OF 20 SPACEBOY NAPKINS
541905    581587     22899  ...          France         CHILDREN'S APRON DOLLY GIRL
541906    581587     23254  ...          France        CHILDRENS CUTLERY DOLLY GIRL
541907    581587     23255  ...          France      CHILDRENS CUTLERY CIRCUS PARADE
541908    581587     22138  ...          France        BAKING SET 9 PIECE RETROSPOT

[540455 rows x 9 columns]

This method returns a new DataFrame with no missing values for the specified columns. If you want to replace the original dataset directly, you can use the inplace=True parameter:

In [0]:
df.dropna(subset=['Description'], inplace=True)

In [54]:
df.isna().sum()

InvoiceNo                    0
StockCode                    0
Description                  0
Quantity                     0
InvoiceDate                  0
UnitPrice                    0
CustomerID              133626
Country                      0
StockCodeDescription         1
dtype: int64

As you can see, there are no more missing values in the Description column. Let's have a look at the CustomerID column:

In [55]:
df[df['CustomerID'].isna()]

       InvoiceNo StockCode  ...         Country             StockCodeDescription
1443      536544     21773  ...  United Kingdom  DECORATIVE ROSE BATHROOM BOTTLE
1444      536544     21774  ...  United Kingdom  DECORATIVE CATS BATHROOM BOTTLE
1445      536544     21786  ...  United Kingdom               POLKADOT RAIN HAT
1446      536544     21787  ...  United Kingdom            RAIN PONCHO RETROSPOT
1447      536544     21790  ...  United Kingdom               VINTAGE SNAP CARDS
...          ...       ...  ...             ...                              ...
541536    581498    85099B  ...  United Kingdom          JUMBO BAG RED RETROSPOT
541537    581498    85099C  ...  United Kingdom   JUMBO  BAG BAROQUE BLACK WHITE
541538    581498     85150  ...  United Kingdom    LADIES & GENTLEMEN METAL SIGN
541539    581498     85174  ...  United Kingdom                S/4 CACTI CANDLES
541540    581498       DOT  ...  United Kingdom                   DOTCOM POSTAGE

[133626 rows x 9 columns]

However, most algorithms require a value for each observation, so you need to provide one for these cases. We will use the .fillna() method from pandas to do this. Provide the value to be imputed as Missing and use inplace=True as a parameter:

In [56]:
df['CustomerID'].fillna('Missing', inplace=True)
df[1443:1448]

     InvoiceNo StockCode  ...         Country                StockCodeDescription
1444    536544     21774  ...  United Kingdom     DECORATIVE CATS BATHROOM BOTTLE
1445    536544     21786  ...  United Kingdom                  POLKADOT RAIN HAT
1446    536544     21787  ...  United Kingdom               RAIN PONCHO RETROSPOT
1447    536544     21790  ...  United Kingdom                  VINTAGE SNAP CARDS
1448    536544     21791  ...  United Kingdom  VINTAGE HEADS AND TAILS CARD GAME

[5 rows x 9 columns]

In [57]:
df.isna().sum()

InvoiceNo               0
StockCode               0
Description             0
Quantity                0
InvoiceDate             0
UnitPrice               0
CustomerID              0
Country                 0
StockCodeDescription    1
dtype: int64

In [58]:
df[df['StockCodeDescription'].isna()]

       InvoiceNo StockCode  ...         Country  StockCodeDescription
420391    572891     23343  ...  United Kingdom                   NaN

[1 rows x 9 columns]

In [0]:
df['StockCodeDescription'].fillna('Missing', inplace=True)

In [60]:
df.isna().sum()

InvoiceNo               0
StockCode               0
Description             0
Quantity                0
InvoiceDate             0
UnitPrice               0
CustomerID              0
Country                 0
StockCodeDescription    0
dtype: int64

Perfect! You have successfully fixed all the missing values in this dataset. These methods also work when we want to handle missing numerical variables. We will look at this in the following exercise. All you need to do is provide a numerical value when you want to impute a value with .fillna().

**Fixing Missing Values for the Horse Colic Dataset**

In [0]:
file_url = 'http://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter11/dataset/horse-colic.data'

In [0]:
df6 = pd.read_csv(file_url, header=None, sep='\s+', prefix='X')

In [63]:
df6.head()

  X0  X1       X2     X3   X4  X5 X6  ...   X21 X22 X23    X24 X25 X26 X27
0  2   1   530101  38.50   66  28  3  ...     ?   2   2  11300   0   0   2
1  1   1   534817   39.2   88  20  ?  ...     2   3   2   2208   0   0   2
2  2   1   530334  38.30   40  24  1  ...     ?   1   2      0   0   0   1
3  1   9  5290409  39.10  164  84  4  ...  5.30   2   1   2208   0   0   1
4  2   1   530255  37.30  104  35  ?  ...     ?   2   2   4300   0   0   2

[5 rows x 28 columns]

As you can see, the authors have used the ? character for missing values, but the pandas package thinks that this is a normal value. You need to transform them into missing values.

Reload the dataset into a pandas DataFrame using the .read_csv() method, but this time, add the na_values='?' parameter in order to specify that this value needs to be treated as a missing value:

In [0]:
df6 = pd.read_csv(file_url, header=None, sep='\s+', prefix='X', na_values='?')

In [65]:
df6.head()

    X0  X1       X2    X3     X4    X5  ...  X22  X23    X24  X25  X26  X27
0  2.0   1   530101  38.5   66.0  28.0  ...  2.0    2  11300    0    0    2
1  1.0   1   534817  39.2   88.0  20.0  ...  3.0    2   2208    0    0    2
2  2.0   1   530334  38.3   40.0  24.0  ...  1.0    2      0    0    0    1
3  1.0   9  5290409  39.1  164.0  84.0  ...  2.0    1   2208    0    0    1
4  2.0   1   530255  37.3  104.0  35.0  ...  2.0    2   4300    0    0    2

[5 rows x 28 columns]

Now, you can see that pandas have converted all the ? values into missing values.

Print the data type of each column using the dtypes attribute:

In [66]:
df6.dtypes

X0     float64
X1       int64
X2       int64
X3     float64
X4     float64
X5     float64
X6     float64
X7     float64
X8     float64
X9     float64
X10    float64
X11    float64
X12    float64
X13    float64
X14    float64
X15    float64
X16    float64
X17    float64
X18    float64
X19    float64
X20    float64
X21    float64
X22    float64
X23      int64
X24      int64
X25      int64
X26      int64
X27      int64
dtype: object

Print the number of missing values for each column by combining the .isna() and .sum() methods:

In [67]:
df6.isna().sum()

X0       1
X1       0
X2       0
X3      60
X4      24
X5      58
X6      56
X7      69
X8      47
X9      32
X10     55
X11     44
X12     56
X13    104
X14    106
X15    247
X16    102
X17    118
X18     29
X19     33
X20    165
X21    198
X22      1
X23      0
X24      0
X25      0
X26      0
X27      0
dtype: int64

Create a condition mask called x0_mask so that you can find the missing values in the X0 column using the .isna() method:

In [0]:
x0_mask = df6['X0'].isna()

In [69]:
x0_mask.head()

0    False
1    False
2    False
3    False
4    False
Name: X0, dtype: bool

In [70]:
x0_mask.sum()

1

Extract the mean of X0 using the .median() method and store it in a new variable called x0_median. Print its value:

In [71]:
x0_median = df6['X0'].median()
print(x0_median)

1.0

The median value for this column is 1. You will replace all the missing values with this value in the X0 column.

Replace all the missing values in the X0 variable with their median using the .fillna() method, along with the inplace=True parameter:

In [0]:
df6['X0'].fillna(x0_median, inplace=True)

Print the number of missing values for X0 by combining the .isna() and .sum() methods:

In [73]:
df6['X0'].isna().sum()

0

Create a for loop that will iterate through all the columns of the DataFrame. In the for loop, calculate the median for each and save them into a variable called col_median. Then, impute missing values with this median value using the .fillna() method, along with the inplace=True parameter, and print the name of the column and its median value:

In [74]:
for col_name in df6.columns:
  col_median = df6[col_name].median()
  df6[col_name].fillna(col_median, inplace=True)
  print(col_name)
  print(col_median)

X0
1.0
X1
1.0
X2
530305.5
X3
38.2
X4
64.0
X5
24.5
X6
3.0
X7
2.0
X8
3.0
X9
1.0
X10
3.0
X11
3.0
X12
2.0
X13
2.0
X14
1.0
X15
5.0
X16
3.0
X17
4.0
X18
45.0
X19
7.5
X20
2.0
X21
2.25
X22
1.0
X23
1.0
X24
2673.5
X25
0.0
X26
0.0
X27
2.0

Print the number of missing values for each column by combining the .isna() and .sum() methods:

In [75]:
df.isna().sum()

InvoiceNo               0
StockCode               0
Description             0
Quantity                0
InvoiceDate             0
UnitPrice               0
CustomerID              0
Country                 0
StockCodeDescription    0
dtype: int64

Well done! You have successfully fixed the missing values for all the numerical variables using the methods provided by the pandas package: .isna() and .fillna().